; domain
(define (domain blocks)
  (:requirements :adl)
  (:predicates
    (hand-empty)
    (holding ?x)
    (on-top ?x ?y) 
    (on-floor ?x)   
    (clear ?x)     
  )
  
  (:action podnies-z-paczki
    :parameters (?x ?y)
    :precondition (and (on-top ?x ?y) (clear ?x) (hand-empty))
    :effect (and (holding ?x) (clear ?y) (not (on-top ?x ?y)) (not(hand-empty)) )
  )

  (:action podnies-z-podlogi
    :parameters (?x)
    :precondition (and (on-floor ?x) (clear ?x) (hand-empty))
    :effect (and (holding ?x) (not (on-floor ?x)) (not (hand-empty)) )
  )

  (:action opusc-na-podloge
    :parameters (?x)
    :precondition (holding ?x)
    :effect (and (on-floor ?x) (clear ?x) (hand-empty) (not(holding ?x)) )
  )

  (:action opusc-na-paczke
    :parameters (?y ?x)
    :precondition (and (holding ?x) (clear ?y) (not (= ?x ?y)) )
    :effect (and (on-top ?x ?y) (clear ?x) (hand-empty) (not (holding ?x)) (not (clear ?y)))
  )
)

; problem
(define (problem p1)
    (:domain blocks)
    (:objects
        a b c d e f
    )
    (:init
        (on-floor a)
        (clear a)
        (on-floor b)
        (clear b)
        (on-floor c)
        (clear c)
        (on-floor d)
        (clear d)
        (on-floor e)
        (clear e)
        (on-floor f)
        (clear f)
        (hand-empty)
    )
    (:goal (and
    (on-floor a)  
    (on-top b a)  
    (on-top c b)  
    (on-top d c)  
    (on-top e d)  
    (on-top f e)  
    (clear f)      
)
)
)

; plan
1. (podnies-z-podlogi f)
   deleted: (on-floor f) (hand-empty)
   added: (holding f)
   goals met: 2 of 7
2. (opusc-na-paczke e f)
   deleted: (holding f) (clear e)
   added: (on-top f e) (hand-empty)
   goals met: 3 of 7
3. (podnies-z-podlogi d)
   deleted: (on-floor d) (hand-empty)
   added: (holding d)
   goals met: 3 of 7
4. (opusc-na-paczke c d)
   deleted: (holding d) (clear c)
   added: (on-top d c) (hand-empty)
   goals met: 4 of 7
5. (podnies-z-podlogi b)
   deleted: (on-floor b) (hand-empty)
   added: (holding b)
   goals met: 4 of 7
6. (opusc-na-paczke a b)
   deleted: (holding b) (clear a)
   added: (on-top b a) (hand-empty)
   goals met: 5 of 7
7. (podnies-z-paczki d c)
   deleted: (on-top d c) (hand-empty)
   added: (holding d) (clear c)
   goals met: 4 of 7
8. (opusc-na-podloge d)
   deleted: (holding d)
   added: (on-floor d) (hand-empty)
   goals met: 4 of 7
9. (podnies-z-podlogi c)
   deleted: (on-floor c) (hand-empty)
   added: (holding c)
   goals met: 4 of 7
10. (opusc-na-paczke b c)
   deleted: (holding c) (clear b)
   added: (on-top c b) (hand-empty)
   goals met: 5 of 7
11. (podnies-z-podlogi d)
   deleted: (on-floor d) (hand-empty)
   added: (holding d)
   goals met: 5 of 7
12. (opusc-na-paczke c d)
   deleted: (holding d) (clear c)
   added: (on-top d c) (hand-empty)
   goals met: 6 of 7
13. (podnies-z-paczki f e)
   deleted: (on-top f e) (hand-empty)
   added: (holding f) (clear e)
   goals met: 5 of 7
14. (opusc-na-podloge f)
   deleted: (holding f)
   added: (on-floor f) (hand-empty)
   goals met: 5 of 7
15. (podnies-z-podlogi e)
   deleted: (on-floor e) (hand-empty)
   added: (holding e)
   goals met: 5 of 7
16. (opusc-na-paczke d e)
   deleted: (holding e) (clear d)
   added: (on-top e d) (hand-empty)
   goals met: 6 of 7
17. (podnies-z-podlogi f)
   deleted: (on-floor f) (hand-empty)
   added: (holding f)
   goals met: 6 of 7
18. (opusc-na-paczke e f)
   deleted: (holding f) (clear e)
   added: (on-top f e) (hand-empty)
   goals met: 7 of 7
